// import {Card} from '../types/card'

const data = {
    // ---------------------------- 5 -------------------------------
    '费洛美螂_5': { // 6
        id: '795',
        star: 5,
        name: '费洛美螂',
    },
    '爆肌蚊_5': { // 6
        id: '794',
        star: 5,
        name: '爆肌蚊',
    },
    '达克莱伊_5': { // 6,2
        id: '491',
        star: 5,
        name: '达克莱伊',
    },
    '凯路迪欧_5': { // 6
        id: '647',
        star: 5,
        name: '凯路迪欧',
    },
    '拉帝欧斯_5': { // 6
        id: '381',
        star: 5,
        name: '拉帝欧斯',
    },
    '拉帝亚斯_5': { // 6
        id: '380',
        star: 5,
        name: '拉帝亚斯',
    },
    '暗黑酋雷姆_5': {// 6
        id: '646',
        star: 5,
        name: '暗黑酋雷姆',
    },
    '焰白酋雷姆_5': {// 6
        id: '646',
        star: 5,
        name: '焰白酋雷姆',
    },
    '奈克洛兹玛_月_5': {// 6
        id: '800',
        star: 5,
        name: '奈克洛兹玛(月)',
    },
    '奈克洛兹玛_日_5': {// 6
        id: '800',
        star: 5,
        name: '奈克洛兹玛(日)',
    },

    '皮卡丘_5': { // 2
        id: '25',
        star: 5,
        name: '皮卡丘',
    },
    '阿尔宙斯_5': { // 2
        id: '493',
        star: 5,
        name: '阿尔宙斯',
    },
    '露奈雅拉_5': { // 2
        id: '792',
        star: 5,
        name: '露奈雅拉',
    },
    '索尔迦雷欧_5': { // 2
        id: '791',
        star: 5,
        name: '索尔迦雷欧',
    },
    '骑拉帝纳_5': { // 2
        id: '487',
        star: 5,
        name: '骑拉帝纳',
    },
    '骑拉帝纳_起源_5': { // 2
        id: '487',
        star: 5,
        name: '骑拉帝纳(起源)',
    },
    '帕路奇亚_5': { // 2
        id: '484',
        star: 5,
        name: '帕路奇亚',
    },
    '帝牙卢卡_5': { // 2
        id: '483',
        star: 5,
        name: '帝牙卢卡',
    },
    '雷吉奇卡斯_5': { // 2
        id: '486',
        star: 5,
        name: '雷吉奇卡斯',
    },

    // ---------------------------- 4 -------------------------------
    '喷火龙_4': { // 幸运
        id: '6',
        star: 4,
        name: '喷火龙',
    },
    '凯路迪欧_4': { // 6
        id: '647',
        star: 4,
        name: '凯路迪欧',
    },
    '比克提尼_4': { // 6
        id: '494',
        star: 4,
        name: '比克提尼',
    },
    '谢米_天空_4': { // 6
        id: '492',
        star: 4,
        name: '谢米(天空)',
    },
    '谢米_刺猬_4': { // 6
        id: '492',
        star: 4,
        name: '谢米(刺猬)',
    },
    '基拉祈_4': { // 6
        id: '385',
        star: 4,
        name: '基拉祈',
    },
    '路卡利欧_4': { // 6
        id: '448',
        star: 4,
        name: '路卡利欧',
    },
    '耿鬼_4': { // 6
        id: '94',
        star: 4,
        name: '耿鬼',
    },
    '胡地_4': { // 6
        id: '65',
        star: 4,
        name: '胡地',
    },
    '怪力_4': { // 6
        id: '68',
        star: 4,
        name: '怪力',
    },
    '庞岩怪_4': { // 6
        id: '526',
        star: 4,
        name: '庞岩怪',
    },
    '快龙_4': { // 6
        id: '149',
        star: 4,
        name: '快龙',
    },
    '鸭嘴炎兽_4': { // 6
        id: '467',
        star: 4,
        name: '鸭嘴炎兽',
    },
    '电击魔兽_4': { // 6
        id: '466',
        star: 4,
        name: '电击魔兽',
    },
    '泥偶巨人_4': { // 6
        id: '623',
        star: 4,
        name: '泥偶巨人',
    },
    '月亮伊布_4': { // 6
        id: '197',
        star: 4,
        name: '月亮伊布',
    },
    '太阳伊布_4': { // 6
        id: '196',
        star: 4,
        name: '太阳伊布',
    },
    '西狮海壬_4': { // 6
        id: '730',
        star: 4,
        name: '西狮海壬',
    },
    '炽焰咆哮虎_4': { // 6
        id: '727',
        star: 4,
        name: '炽焰咆哮虎',
    },
    '狙射树枭_4': { // 6
        id: '724',
        star: 4,
        name: '狙射树枭',
    },

    // ---------------------------- 3 -------------------------------
    '拉普拉斯_3': { // 幸运
        id: '131',
        star: 3,
        name: '拉普拉斯',
    },
    '路卡利欧_3': { // 6
        id: '448',
        star: 3,
        name: '路卡利欧',
    },
    '耿鬼_3': { // 6
        id: '94',
        star: 3,
        name: '耿鬼',
    },
    '胡地_3': { // 6
        id: '65',
        star: 3,
        name: '胡地',
    },
    '怪力_3': { // 6
        id: '68',
        star: 3,
        name: '怪力',
    },
    '庞岩怪_3': { // 6
        id: '526',
        star: 3,
        name: '庞岩怪',
    },
    '快龙_3': { // 6
        id: '149',
        star: 3,
        name: '快龙',
    },
    '鸭嘴炎兽_3': { // 6
        id: '467',
        star: 3,
        name: '鸭嘴炎兽',
    },
    '电击魔兽_3': { // 6
        id: '466',
        star: 3,
        name: '电击魔兽',
    },
    '泥偶巨人_3': { // 6
        id: '623',
        star: 3,
        name: '泥偶巨人',
    },
    '嘟嘟利_3': { // 6
        id: '85',
        star: 3,
        name: '嘟嘟利',
    },
    '月亮伊布_3': { // 6
        id: '197',
        star: 3,
        name: '月亮伊布',
    },
    '太阳伊布_3': { // 6
        id: '196',
        star: 3,
        name: '太阳伊布',
    },
    '西狮海壬_3': { // 6
        id: '730',
        star: 3,
        name: '西狮海壬',
    },
    '炽焰咆哮虎_3': { // 6
        id: '727',
        star: 3,
        name: '炽焰咆哮虎',
    },
    '狙射树枭_3': { // 6
        id: '724',
        star: 3,
        name: '狙射树枭',
    },

    // ---------------------------- 2 -------------------------------
    '路卡利欧_2': { // 6
        id: '448',
        star: 2,
        name: '路卡利欧',
    },
    '鬼斯通_2': { // 6
        id: '93',
        star: 2,
        name: '鬼斯通',
    },
    '勇基拉_2': { // 6
        id: '64',
        star: 2,
        name: '勇基拉',
    },
    '豪力_2': { // 6
        id: '67',
        star: 2,
        name: '豪力',
    },
    '地幔岩_2': { // 6
        id: '525',
        star: 2,
        name: '地幔岩',
    },
    '哈克龙_2': { // 6
        id: '148',
        star: 2,
        name: '哈克龙',
    },
    '鸭嘴火兽_2': { // 6
        id: '126',
        star: 2,
        name: '鸭嘴火兽',
    },
    '电击兽_2': { // 6
        id: '125',
        star: 2,
        name: '电击兽',
    },
    '泥偶小人_2': { // 6
        id: '622',
        star: 2,
        name: '泥偶小人',
    },
    '嘟嘟利_2': { // 6
        id: '85',
        star: 2,
        name: '嘟嘟利',
    },
    '花漾海狮_2': { // 6
        id: '729',
        star: 2,
        name: '花漾海狮',
    },
    '炎热喵_2': { // 6
        id: '726',
        star: 2,
        name: '炎热喵',
    },
    '投羽枭_2': { // 6
        id: '723',
        star: 2,
        name: '投羽枭',
    },

    // ---------------------------- 1 -------------------------------
    '利欧路_1': { // 6
        id: '447',
        star: 1,
        name: '利欧路',
    },
    '鬼斯_1': { // 6
        id: '92',
        star: 1,
        name: '鬼斯',
    },
    '凯西_1': { // 6
        id: '63',
        star: 1,
        name: '凯西',
    },
    '腕力_1': { // 6
        id: '66',
        star: 1,
        name: '腕力',
    },
    '石丸子_1': { // 6
        id: '524',
        star: 1,
        name: '石丸子',
    },
    '迷你龙_1': { // 6
        id: '147',
        star: 1,
        name: '迷你龙',
    },
    '鸭嘴宝宝_1': { // 6
        id: '240',
        star: 1,
        name: '鸭嘴宝宝',
    },
    '电击怪_1': { // 6
        id: '239',
        star: 1,
        name: '电击怪',
    },
    '嘟嘟_1': { // 6
        id: '84',
        star: 1,
        name: '嘟嘟',
    },
    '球球海狮_1': { // 6
        id: '728',
        star: 1,
        name: '球球海狮',
    },
    '火斑喵_1': { // 6
        id: '725',
        star: 1,
        name: '火斑喵',
    },
    '木木枭_1': { // 6
        id: '722',
        star: 1,
        name: '木木枭',
    },


    '菊草叶_1': { // 5
        id: '152',
        star: 1,
        name: '菊草叶',
    },

} as const

export default data;